ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405cx.h
#define TMR1_BASE                    (APB2PERIPH_BASE + 0x00000000U) /*!< TMR1 base address                              */
#define USART1_BASE                  (APB2PERIPH_BASE + 0x00001000U) /*!< USART1 base address                            */
#define USART6_BASE                  (APB2PERIPH_BASE + 0x00001400U) /*!< USART6 base address                            */

#define ADC1_BASE                    (APB2PERIPH_BASE + 0x00002000U) /*!< ADC1 base address                              */
#define ADC_Common_BASE              (APB2PERIPH_BASE + 0x00002300U) /*!< ADC Common base address                        */

#define SPI1_BASE                    (APB2PERIPH_BASE + 0x00003000U) /*!< SPI1 base address                              */
#define SCFG_BASE                    (APB2PERIPH_BASE + 0x00003800U) /*!< SCFG base address                              */
#define EXINT_BASE                   (APB2PERIPH_BASE + 0x00003C00U) /*!< EXINT base address                             */
#define TMR9_BASE                    (APB2PERIPH_BASE + 0x00004000U) /*!< TMR9 base address                              */
#define TMR10_BASE                   (APB2PERIPH_BASE + 0x00004400U) /*!< TMR10 base address                             */
#define TMR11_BASE                   (APB2PERIPH_BASE + 0x00004800U) /*!< TMR11 base address                             */
#define I2SF5_BASE                   (APB2PERIPH_BASE + 0x00005000U) /*!< I2SF5 base address                             */
#define ACC_BASE                     (APB2PERIPH_BASE + 0x00007400U) /*!< ACC base address                               */

#define GPIOA_BASE                   (AHBPERIPH_BASE + 0x00000000U)  /*!< GPIOA base address                             */
#define GPIOB_BASE                   (AHBPERIPH_BASE + 0x00000400U)  /*!< GPIOB base address                             */
#define GPIOC_BASE                   (AHBPERIPH_BASE + 0x00000800U)  /*!< GPIOC base address                             */
#define GPIOD_BASE                   (AHBPERIPH_BASE + 0x00000C00U)  /*!< GPIOD base address                             */
#define GPIOF_BASE                   (AHBPERIPH_BASE + 0x00001400U)  /*!< GPIOF base address                             */
#define CRC_BASE                     (AHBPERIPH_BASE + 0x00003000U)  /*!< CRC base address                               */
#define CRM_BASE                     (AHBPERIPH_BASE + 0x00003800U)  /*!< CRM base address                               */

#define DMA1_BASE                    (AHBPERIPH_BASE + 0x00006000U)  /*!< DMA1 base address                              */
#define DMA1_Channel1_BASE           (AHBPERIPH_BASE + 0x00006008U)  /*!< DMA1 Channel 1 base address                    */
#define DMA1_Channel2_BASE           (AHBPERIPH_BASE + 0x0000601CU)  /*!< DMA1 Channel 2 base address                    */
#define DMA1_Channel3_BASE           (AHBPERIPH_BASE + 0x00006030U)  /*!< DMA1 Channel 3 base address                    */
#define DMA1_Channel4_BASE           (AHBPERIPH_BASE + 0x00006044U)  /*!< DMA1 Channel 4 base address                    */
#define DMA1_Channel5_BASE           (AHBPERIPH_BASE + 0x00006058U)  /*!< DMA1 Channel 5 base address                    */
#define DMA1_Channel6_BASE           (AHBPERIPH_BASE + 0x0000606CU)  /*!< DMA1 Channel 6 base address                    */
#define DMA1_Channel7_BASE           (AHBPERIPH_BASE + 0x00006080U)  /*!< DMA1 Channel 7 base address                    */

#define DMA1MUX_BASE                 (AHBPERIPH_BASE + 0x00006104U)  /*!< DMA1 Multiplexed base address                  */
#define DMA1MUX_Channel1_BASE        (DMA1MUX_BASE)                  /*!< DMA1 Multiplexed Channel 1 base address        */
#define DMA1MUX_Channel2_BASE        (AHBPERIPH_BASE + 0x00006108U)  /*!< DMA1 Multiplexed Channel 2 base address        */
#define DMA1MUX_Channel3_BASE        (AHBPERIPH_BASE + 0x0000610CU)  /*!< DMA1 Multiplexed Channel 3 base address        */
#define DMA1MUX_Channel4_BASE        (AHBPERIPH_BASE + 0x00006110U)  /*!< DMA1 Multiplexed Channel 4 base address        */
#define DMA1MUX_Channel5_BASE        (AHBPERIPH_BASE + 0x00006114U)  /*!< DMA1 Multiplexed Channel 5 base address        */
#define DMA1MUX_Channel6_BASE        (AHBPERIPH_BASE + 0x00006118U)  /*!< DMA1 Multiplexed Channel 6 base address        */
#define DMA1MUX_Channel7_BASE        (AHBPERIPH_BASE + 0x0000611CU)  /*!< DMA1 Multiplexed Channel 7 base address        */
#define DMA1MUX_Generator1_BASE      (AHBPERIPH_BASE + 0x00006120U)  /*!< DMA1 Multiplexed Generator 1 base address      */
#define DMA1MUX_Generator2_BASE      (AHBPERIPH_BASE + 0x00006124U)  /*!< DMA1 Multiplexed Generator 2 base address      */
#define DMA1MUX_Generator3_BASE      (AHBPERIPH_BASE + 0x00006128U)  /*!< DMA1 Multiplexed Generator 3 base address      */
#define DMA1MUX_Generator4_BASE      (AHBPERIPH_BASE + 0x0000612CU)  /*!< DMA1 Multiplexed Generator 4 base address      */
#define DMA1MUX_ChannelStatus_BASE   (AHBPERIPH_BASE + 0x00006130U)  /*!< DMA1 Multiplexed Channel status base address   */
#define DMA1MUX_GeneratorStatus_BASE (AHBPERIPH_BASE + 0x00006138U)  /*!< DMA1 Multiplexed Generator status base address */

#define DMA2_BASE                    (AHBPERIPH_BASE + 0x00006400U)  /*!< DMA2 base address                              */
#define DMA2_Channel1_BASE           (AHBPERIPH_BASE + 0x00006408U)  /*!< DMA2 Channel 1 base address                    */
#define DMA2_Channel2_BASE           (AHBPERIPH_BASE + 0x0000641CU)  /*!< DMA2 Channel 2 base address                    */
#define DMA2_Channel3_BASE           (AHBPERIPH_BASE + 0x00006430U)  /*!< DMA2 Channel 3 base address                    */
#define DMA2_Channel4_BASE           (AHBPERIPH_BASE + 0x00006444U)  /*!< DMA2 Channel 4 base address                    */
#define DMA2_Channel5_BASE           (AHBPERIPH_BASE + 0x00006458U)  /*!< DMA2 Channel 5 base address                    */
#define DMA2_Channel6_BASE           (AHBPERIPH_BASE + 0x0000646CU)  /*!< DMA2 Channel 6 base address                    */
#define DMA2_Channel7_BASE           (AHBPERIPH_BASE + 0x00006480U)  /*!< DMA2 Channel 7 base address                    */

#define DMA2MUX_BASE                 (AHBPERIPH_BASE + 0x00006504U)  /*!< DMA2 Multiplexed base address                  */
#define DMA2MUX_Channel1_BASE        (DMA2MUX_BASE)                  /*!< DMA2 Multiplexed Channel 1 base address        */
#define DMA2MUX_Channel2_BASE        (AHBPERIPH_BASE + 0x00006508U)  /*!< DMA2 Multiplexed Channel 2 base address        */
#define DMA2MUX_Channel3_BASE        (AHBPERIPH_BASE + 0x0000650CU)  /*!< DMA2 Multiplexed Channel 3 base address        */
#define DMA2MUX_Channel4_BASE        (AHBPERIPH_BASE + 0x00006510U)  /*!< DMA2 Multiplexed Channel 4 base address        */
#define DMA2MUX_Channel5_BASE        (AHBPERIPH_BASE + 0x00006514U)  /*!< DMA2 Multiplexed Channel 5 base address        */
#define DMA2MUX_Channel6_BASE        (AHBPERIPH_BASE + 0x00006518U)  /*!< DMA2 Multiplexed Channel 6 base address        */
#define DMA2MUX_Channel7_BASE        (AHBPERIPH_BASE + 0x0000651CU)  /*!< DMA2 Multiplexed Channel 7 base address        */
#define DMA2MUX_Generator1_BASE      (AHBPERIPH_BASE + 0x00006520U)  /*!< DMA2 Multiplexed Generator 1 base address      */
#define DMA2MUX_Generator2_BASE      (AHBPERIPH_BASE + 0x00006524U)  /*!< DMA2 Multiplexed Generator 2 base address      */
#define DMA2MUX_Generator3_BASE      (AHBPERIPH_BASE + 0x00006528U)  /*!< DMA2 Multiplexed Generator 3 base address      */
#define DMA2MUX_Generator4_BASE      (AHBPERIPH_BASE + 0x0000652CU)  /*!< DMA2 Multiplexed Generator 4 base address      */
#define DMA2MUX_ChannelStatus_BASE   (AHBPERIPH_BASE + 0x00006530U)  /*!< DMA2 Multiplexed Channel status base address   */
#define DMA2MUX_GeneratorStatus_BASE (AHBPERIPH_BASE + 0x00006538U)  /*!< DMA2 Multiplexed Generator status base address */

#define FLASH_R_BASE                 (AHBPERIPH_BASE + 0x00003C00U)  /*!< FLASH registers base address                   */
#define QSPI1_R_BASE                 0xA0001000U                     /*!< QSPI1 registers base address                   */
#define FLASHSIZE_BASE               0x1FFFF7E0U                     /*!< FLASH Size register base address               */
#define UID_BASE                     0x1FFFF7E8U                     /*!< Unique device ID register base address         */
#define USD_BASE                     0x1FFFF800U                     /*!< FLASH User System Data base address            */

