ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405cx.h
/*****************  Bit definition for FLASH_DATA1 register  ******************/
#define FLASH_DATA1_DATA1_Pos               (16U)
#define FLASH_DATA1_DATA1_Msk               (0xFFU << FLASH_DATA1_DATA1_Pos)        /*!< 0x00FF0000 */
#define FLASH_DATA1_DATA1                   FLASH_DATA1_DATA1_Msk                   /*!< User data 1 */
#define FLASH_DATA1_nDATA1_Pos              (24U)
#define FLASH_DATA1_nDATA1_Msk              (0xFFU << FLASH_DATA1_nDATA1_Pos)       /*!< 0xFF000000 */
#define FLASH_DATA1_nDATA1                  FLASH_DATA1_nDATA1_Msk                  /*!< Inverse code of user data 1 */

/******************  Bit definition for FLASH_EPP0 register  ******************/
#define FLASH_EPP0_EPP0_Pos                 (0U)
#define FLASH_EPP0_EPP0_Msk                 (0xFFU << FLASH_EPP0_EPP0_Pos)          /*!< 0x000000FF */
#define FLASH_EPP0_EPP0                     FLASH_EPP0_EPP0_Msk                     /*!< Flash erase/write protection byte 0 */
#define FLASH_EPP0_nEPP0_Pos                (8U)
#define FLASH_EPP0_nEPP0_Msk                (0xFFU << FLASH_EPP0_nEPP0_Pos)         /*!< 0x0000FF00 */
#define FLASH_EPP0_nEPP0                    FLASH_EPP0_nEPP0_Msk                    /*!< Inverse code of flash erase/write protection byte 0 */

/******************  Bit definition for FLASH_EPP1 register  ******************/
#define FLASH_EPP1_EPP1_Pos                 (16U)
#define FLASH_EPP1_EPP1_Msk                 (0xFFU << FLASH_EPP1_EPP1_Pos)          /*!< 0x00FF0000 */
#define FLASH_EPP1_EPP1                     FLASH_EPP1_EPP1_Msk                     /*!< Flash erase/write protection byte 1 */
#define FLASH_EPP1_nEPP1_Pos                (24U)
#define FLASH_EPP1_nEPP1_Msk                (0xFFU << FLASH_EPP1_nEPP1_Pos)         /*!< 0xFF000000 */
#define FLASH_EPP1_nEPP1                    FLASH_EPP1_nEPP1_Msk                    /*!< Inverse code of flash erase/write protection byte 1 */

/******************  Bit definition for FLASH_EPP2 register  ******************/
#define FLASH_EPP2_EPP2_Pos                 (0U)
#define FLASH_EPP2_EPP2_Msk                 (0xFFU << FLASH_EPP2_EPP2_Pos)          /*!< 0x000000FF */
#define FLASH_EPP2_EPP2                     FLASH_EPP2_EPP2_Msk                     /*!< Flash erase/write protection byte 2 */
#define FLASH_EPP2_nEPP2_Pos                (8U)
#define FLASH_EPP2_nEPP2_Msk                (0xFFU << FLASH_EPP2_nEPP2_Pos)         /*!< 0x0000FF00 */
#define FLASH_EPP2_nEPP2                    FLASH_EPP2_nEPP2_Msk                    /*!< Inverse code of flash erase/write protection byte 2 */

/******************  Bit definition for FLASH_EPP3 register  ******************/
#define FLASH_EPP3_EPP3_Pos                 (16U)
#define FLASH_EPP3_EPP3_Msk                 (0xFFU << FLASH_EPP3_EPP3_Pos)          /*!< 0x00FF0000 */
#define FLASH_EPP3_EPP3                     FLASH_EPP3_EPP3_Msk                     /*!< Flash erase/write protection byte 3 */
#define FLASH_EPP3_nEPP3_Pos                (24U)
#define FLASH_EPP3_nEPP3_Msk                (0xFFU << FLASH_EPP3_nEPP3_Pos)         /*!< 0xFF000000 */
#define FLASH_EPP3_nEPP3                    FLASH_EPP3_nEPP3_Msk                    /*!< Inverse code of flash erase/write protection byte 3 */

/****************  Bit definition for FLASH_QSPIKEY0 register  ****************/
#define FLASH_QSPIKEY0_QSPIKEY0_Pos         (0U)
#define FLASH_QSPIKEY0_QSPIKEY0_Msk         (0xFFU << FLASH_QSPIKEY0_QSPIKEY0_Pos)  /*!< 0x000000FF */
#define FLASH_QSPIKEY0_QSPIKEY0             FLASH_QSPIKEY0_QSPIKEY0_Msk             /*!< QSPI ciphertext access area encryption key byte 0 */
#define FLASH_QSPIKEY0_nQSPIKEY0_Pos        (8U)
#define FLASH_QSPIKEY0_nQSPIKEY0_Msk        (0xFFU << FLASH_QSPIKEY0_nQSPIKEY0_Pos) /*!< 0x0000FF00 */
#define FLASH_QSPIKEY0_nQSPIKEY0            FLASH_QSPIKEY0_nQSPIKEY0_Msk            /*!< Inverse code of QSPI ciphertext access area encryption key byte 0 */

/****************  Bit definition for FLASH_QSPIKEY1 register  ****************/
#define FLASH_QSPIKEY1_QSPIKEY1_Pos         (16U)
#define FLASH_QSPIKEY1_QSPIKEY1_Msk         (0xFFU << FLASH_QSPIKEY1_QSPIKEY1_Pos)  /*!< 0x00FF0000 */
#define FLASH_QSPIKEY1_QSPIKEY1             FLASH_QSPIKEY1_QSPIKEY1_Msk             /*!< QSPI ciphertext access area encryption key byte 1 */
#define FLASH_QSPIKEY1_nQSPIKEY1_Pos        (23U)
#define FLASH_QSPIKEY1_nQSPIKEY1_Msk        (0xFFU << FLASH_QSPIKEY1_nQSPIKEY1_Pos) /*!< 0xFF000000 */
#define FLASH_QSPIKEY1_nQSPIKEY1            FLASH_QSPIKEY1_nQSPIKEY1_Msk            /*!< Inverse code of QSPI ciphertext access area encryption key byte 1 */

/****************  Bit definition for FLASH_QSPIKEY2 register  ****************/
#define FLASH_QSPIKEY2_QSPIKEY2_Pos         (0U)
#define FLASH_QSPIKEY2_QSPIKEY2_Msk         (0xFFU << FLASH_QSPIKEY2_QSPIKEY2_Pos)  /*!< 0x000000FF */
#define FLASH_QSPIKEY2_QSPIKEY2             FLASH_QSPIKEY2_QSPIKEY2_Msk             /*!< QSPI ciphertext access area encryption key byte 2 */
#define FLASH_QSPIKEY2_nQSPIKEY2_Pos        (8U)
#define FLASH_QSPIKEY2_nQSPIKEY2_Msk        (0xFFU << FLASH_QSPIKEY2_nQSPIKEY2_Pos) /*!< 0x0000FF00 */
#define FLASH_QSPIKEY2_nQSPIKEY2            FLASH_QSPIKEY2_nQSPIKEY2_Msk            /*!< Inverse code of QSPI ciphertext access area encryption key byte 2 */

/****************  Bit definition for FLASH_QSPIKEY3 register  ****************/
#define FLASH_QSPIKEY3_QSPIKEY3_Pos         (16U)
#define FLASH_QSPIKEY3_QSPIKEY3_Msk         (0xFFU << FLASH_QSPIKEY3_QSPIKEY3_Pos)  /*!< 0x00FF0000 */
#define FLASH_QSPIKEY3_QSPIKEY3             FLASH_QSPIKEY3_QSPIKEY3_Msk             /*!< QSPI ciphertext access area encryption key byte 3 */
#define FLASH_QSPIKEY3_nQSPIKEY3_Pos        (23U)
#define FLASH_QSPIKEY3_nQSPIKEY3_Msk        (0xFFU << FLASH_QSPIKEY3_nQSPIKEY3_Pos) /*!< 0xFF000000 */
#define FLASH_QSPIKEY3_nQSPIKEY3            FLASH_QSPIKEY3_nQSPIKEY3_Msk            /*!< Inverse code of QSPI ciphertext access area encryption key byte 3 */

/*****************  Bit definition for FLASH_DATA2 register  ******************/
#define FLASH_DATA2_DATA2_Pos               (0U)
#define FLASH_DATA2_DATA2_Msk               (0xFFU << FLASH_DATA2_DATA2_Pos)        /*!< 0x000000FF */
#define FLASH_DATA2_DATA2                   FLASH_DATA2_DATA2_Msk                   /*!< User data 2 */
#define FLASH_DATA2_nDATA2_Pos              (8U)
#define FLASH_DATA2_nDATA2_Msk              (0xFFU << FLASH_DATA2_nDATA2_Pos)       /*!< 0x0000FF00 */
#define FLASH_DATA2_nDATA2                  FLASH_DATA2_nDATA2_Msk                  /*!< Inverse code of user data 2 */

/*****************  Bit definition for FLASH_DATA3 register  ******************/
#define FLASH_DATA3_DATA3_Pos               (16U)
#define FLASH_DATA3_DATA3_Msk               (0xFFU << FLASH_DATA3_DATA3_Pos)        /*!< 0x00FF0000 */
#define FLASH_DATA3_DATA3                   FLASH_DATA3_DATA3_Msk                   /*!< User data 3 */
#define FLASH_DATA3_nDATA3_Pos              (24U)
#define FLASH_DATA3_nDATA3_Msk              (0xFFU << FLASH_DATA3_nDATA3_Pos)       /*!< 0xFF000000 */
#define FLASH_DATA3_nDATA3                  FLASH_DATA3_nDATA3_Msk                  /*!< Inverse code of user data 3 */

/*****************  Bit definition for FLASH_DATA4 register  ******************/
#define FLASH_DATA4_DATA4_Pos               (0U)
#define FLASH_DATA4_DATA4_Msk               (0xFFU << FLASH_DATA4_DATA4_Pos)        /*!< 0x000000FF */
#define FLASH_DATA4_DATA4                   FLASH_DATA4_DATA4_Msk                   /*!< User data 4 */
#define FLASH_DATA4_nDATA4_Pos              (8U)
#define FLASH_DATA4_nDATA4_Msk              (0xFFU << FLASH_DATA4_nDATA4_Pos)       /*!< 0x0000FF00 */
#define FLASH_DATA4_nDATA4                  FLASH_DATA4_nDATA4_Msk                  /*!< Inverse code of user data 4 */

