ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405cx.h
/*!< ODRV11 configuration */
#define GPIO_ODRVR_ODRV11_Pos               (22U)
#define GPIO_ODRVR_ODRV11_Msk               (0x3U << GPIO_ODRVR_ODRV11_Pos)         /*!< 0x00C00000 */
#define GPIO_ODRVR_ODRV11                   GPIO_ODRVR_ODRV11_Msk                   /*!< ODRV11[1:0] bits (GPIO x drive capability, pin 11) */
#define GPIO_ODRVR_ODRV11_0                 (0x1U << GPIO_ODRVR_ODRV11_Pos)         /*!< 0x00400000 */
#define GPIO_ODRVR_ODRV11_1                 (0x2U << GPIO_ODRVR_ODRV11_Pos)         /*!< 0x00800000 */

/*!< ODRV12 configuration */
#define GPIO_ODRVR_ODRV12_Pos               (24U)
#define GPIO_ODRVR_ODRV12_Msk               (0x3U << GPIO_ODRVR_ODRV12_Pos)         /*!< 0x03000000 */
#define GPIO_ODRVR_ODRV12                   GPIO_ODRVR_ODRV12_Msk                   /*!< ODRV12[1:0] bits (GPIO x drive capability, pin 12) */
#define GPIO_ODRVR_ODRV12_0                 (0x1U << GPIO_ODRVR_ODRV12_Pos)         /*!< 0x01000000 */
#define GPIO_ODRVR_ODRV12_1                 (0x2U << GPIO_ODRVR_ODRV12_Pos)         /*!< 0x02000000 */

/*!< ODRV13 configuration */
#define GPIO_ODRVR_ODRV13_Pos               (26U)
#define GPIO_ODRVR_ODRV13_Msk               (0x3U << GPIO_ODRVR_ODRV13_Pos)         /*!< 0x0C000000 */
#define GPIO_ODRVR_ODRV13                   GPIO_ODRVR_ODRV13_Msk                   /*!< ODRV13[1:0] bits (GPIO x drive capability, pin 13) */
#define GPIO_ODRVR_ODRV13_0                 (0x1U << GPIO_ODRVR_ODRV13_Pos)         /*!< 0x04000000 */
#define GPIO_ODRVR_ODRV13_1                 (0x2U << GPIO_ODRVR_ODRV13_Pos)         /*!< 0x08000000 */

/*!< ODRV14 configuration */
#define GPIO_ODRVR_ODRV14_Pos               (28U)
#define GPIO_ODRVR_ODRV14_Msk               (0x3U << GPIO_ODRVR_ODRV14_Pos)         /*!< 0x30000000 */
#define GPIO_ODRVR_ODRV14                   GPIO_ODRVR_ODRV14_Msk                   /*!< ODRV14[1:0] bits (GPIO x drive capability, pin 14) */
#define GPIO_ODRVR_ODRV14_0                 (0x1U << GPIO_ODRVR_ODRV14_Pos)         /*!< 0x10000000 */
#define GPIO_ODRVR_ODRV14_1                 (0x2U << GPIO_ODRVR_ODRV14_Pos)         /*!< 0x20000000 */

/*!< ODRV15 configuration */
#define GPIO_ODRVR_ODRV15_Pos               (30U)
#define GPIO_ODRVR_ODRV15_Msk               (0x3U << GPIO_ODRVR_ODRV15_Pos)         /*!< 0xC0000000 */
#define GPIO_ODRVR_ODRV15                   GPIO_ODRVR_ODRV15_Msk                   /*!< ODRV15[1:0] bits (GPIO x drive capability, pin 15) */
#define GPIO_ODRVR_ODRV15_0                 (0x1U << GPIO_ODRVR_ODRV15_Pos)         /*!< 0x40000000 */
#define GPIO_ODRVR_ODRV15_1                 (0x2U << GPIO_ODRVR_ODRV15_Pos)         /*!< 0x80000000 */

/******************  Bit definition for GPIO_PULL register  *******************/
#define GPIO_PULL_PULL_Pos                  (0U)
#define GPIO_PULL_PULL_Msk                  (0xFFFFFFFFU << GPIO_PULL_PULL_Pos)     /*!< 0xFFFFFFFF */
#define GPIO_PULL_PULL                      GPIO_PULL_PULL_Msk                      /*!< GPIO x pull-up/pull-down configuration */

/*!< PULL0 configuration */
#define GPIO_PULL_PULL0_Pos                 (0U)
#define GPIO_PULL_PULL0_Msk                 (0x3U << GPIO_PULL_PULL0_Pos)           /*!< 0x00000003 */
#define GPIO_PULL_PULL0                     GPIO_PULL_PULL0_Msk                     /*!< PULL0[1:0] bits (GPIO x pull-up/pull-down configuration, pin 0) */
#define GPIO_PULL_PULL0_0                   (0x1U << GPIO_PULL_PULL0_Pos)           /*!< 0x00000001 */
#define GPIO_PULL_PULL0_1                   (0x2U << GPIO_PULL_PULL0_Pos)           /*!< 0x00000002 */

/*!< PULL1 configuration */
#define GPIO_PULL_PULL1_Pos                 (2U)
#define GPIO_PULL_PULL1_Msk                 (0x3U << GPIO_PULL_PULL1_Pos)           /*!< 0x0000000C */
#define GPIO_PULL_PULL1                     GPIO_PULL_PULL1_Msk                     /*!< PULL1[1:0] bits (GPIO x pull-up/pull-down configuration, pin 1) */
#define GPIO_PULL_PULL1_0                   (0x1U << GPIO_PULL_PULL1_Pos)           /*!< 0x00000004 */
#define GPIO_PULL_PULL1_1                   (0x2U << GPIO_PULL_PULL1_Pos)           /*!< 0x00000008 */

/*!< PULL2 configuration */
#define GPIO_PULL_PULL2_Pos                 (4U)
#define GPIO_PULL_PULL2_Msk                 (0x3U << GPIO_PULL_PULL2_Pos)           /*!< 0x00000030 */
#define GPIO_PULL_PULL2                     GPIO_PULL_PULL2_Msk                     /*!< PULL2[1:0] bits (GPIO x pull-up/pull-down configuration, pin 2) */
#define GPIO_PULL_PULL2_0                   (0x1U << GPIO_PULL_PULL2_Pos)           /*!< 0x00000010 */
#define GPIO_PULL_PULL2_1                   (0x2U << GPIO_PULL_PULL2_Pos)           /*!< 0x00000020 */

/*!< PULL3 configuration */
#define GPIO_PULL_PULL3_Pos                 (6U)
#define GPIO_PULL_PULL3_Msk                 (0x3U << GPIO_PULL_PULL3_Pos)           /*!< 0x000000C0 */
#define GPIO_PULL_PULL3                     GPIO_PULL_PULL3_Msk                     /*!< PULL3[1:0] bits (GPIO x pull-up/pull-down configuration, pin 3) */
#define GPIO_PULL_PULL3_0                   (0x1U << GPIO_PULL_PULL3_Pos)           /*!< 0x00000040 */
#define GPIO_PULL_PULL3_1                   (0x2U << GPIO_PULL_PULL3_Pos)           /*!< 0x00000080 */

/*!< PULL4 configuration */
#define GPIO_PULL_PULL4_Pos                 (8U)
#define GPIO_PULL_PULL4_Msk                 (0x3U << GPIO_PULL_PULL4_Pos)           /*!< 0x00000300 */
#define GPIO_PULL_PULL4                     GPIO_PULL_PULL4_Msk                     /*!< PULL4[1:0] bits (GPIO x pull-up/pull-down configuration, pin 4) */
#define GPIO_PULL_PULL4_0                   (0x1U << GPIO_PULL_PULL4_Pos)           /*!< 0x00000100 */
#define GPIO_PULL_PULL4_1                   (0x2U << GPIO_PULL_PULL4_Pos)           /*!< 0x00000200 */

/*!< PULL5 configuration */
#define GPIO_PULL_PULL5_Pos                 (10U)
#define GPIO_PULL_PULL5_Msk                 (0x3U << GPIO_PULL_PULL5_Pos)           /*!< 0x00000C00 */
#define GPIO_PULL_PULL5                     GPIO_PULL_PULL5_Msk                     /*!< PULL5[1:0] bits (GPIO x pull-up/pull-down configuration, pin 5) */
#define GPIO_PULL_PULL5_0                   (0x1U << GPIO_PULL_PULL5_Pos)           /*!< 0x00000400 */
#define GPIO_PULL_PULL5_1                   (0x2U << GPIO_PULL_PULL5_Pos)           /*!< 0x00000800 */

/*!< PULL6 configuration */
#define GPIO_PULL_PULL6_Pos                 (12U)
#define GPIO_PULL_PULL6_Msk                 (0x3U << GPIO_PULL_PULL6_Pos)           /*!< 0x00003000 */
#define GPIO_PULL_PULL6                     GPIO_PULL_PULL6_Msk                     /*!< PULL6[1:0] bits (GPIO x pull-up/pull-down configuration, pin 6) */
#define GPIO_PULL_PULL6_0                   (0x1U << GPIO_PULL_PULL6_Pos)           /*!< 0x00001000 */
#define GPIO_PULL_PULL6_1                   (0x2U << GPIO_PULL_PULL6_Pos)           /*!< 0x00002000 */

/*!< PULL7 configuration */
#define GPIO_PULL_PULL7_Pos                 (14U)
#define GPIO_PULL_PULL7_Msk                 (0x3U << GPIO_PULL_PULL7_Pos)           /*!< 0x0000C000 */
#define GPIO_PULL_PULL7                     GPIO_PULL_PULL7_Msk                     /*!< PULL7[1:0] bits (GPIO x pull-up/pull-down configuration, pin 7) */
#define GPIO_PULL_PULL7_0                   (0x1U << GPIO_PULL_PULL7_Pos)           /*!< 0x00004000 */
#define GPIO_PULL_PULL7_1                   (0x2U << GPIO_PULL_PULL7_Pos)           /*!< 0x00008000 */

/*!< PULL8 configuration */
#define GPIO_PULL_PULL8_Pos                 (16U)
#define GPIO_PULL_PULL8_Msk                 (0x3U << GPIO_PULL_PULL8_Pos)           /*!< 0x00030000 */
#define GPIO_PULL_PULL8                     GPIO_PULL_PULL8_Msk                     /*!< PULL8[1:0] bits (GPIO x pull-up/pull-down configuration, pin 8) */
#define GPIO_PULL_PULL8_0                   (0x1U << GPIO_PULL_PULL8_Pos)           /*!< 0x00010000 */
#define GPIO_PULL_PULL8_1                   (0x2U << GPIO_PULL_PULL8_Pos)           /*!< 0x00020000 */

/*!< PULL9 configuration */
#define GPIO_PULL_PULL9_Pos                 (18U)
#define GPIO_PULL_PULL9_Msk                 (0x3U << GPIO_PULL_PULL9_Pos)           /*!< 0x000C0000 */
#define GPIO_PULL_PULL9                     GPIO_PULL_PULL9_Msk                     /*!< PULL9[1:0] bits (GPIO x pull-up/pull-down configuration, pin 9) */
#define GPIO_PULL_PULL9_0                   (0x1U << GPIO_PULL_PULL9_Pos)           /*!< 0x00040000 */
#define GPIO_PULL_PULL9_1                   (0x2U << GPIO_PULL_PULL9_Pos)           /*!< 0x00080000 */

/*!< PULL10 configuration */
#define GPIO_PULL_PULL10_Pos                (20U)
#define GPIO_PULL_PULL10_Msk                (0x3U << GPIO_PULL_PULL10_Pos)          /*!< 0x00300000 */
#define GPIO_PULL_PULL10                    GPIO_PULL_PULL10_Msk                    /*!< PULL10[1:0] bits (GPIO x pull-up/pull-down configuration, pin 10) */
#define GPIO_PULL_PULL10_0                  (0x1U << GPIO_PULL_PULL10_Pos)          /*!< 0x00100000 */
#define GPIO_PULL_PULL10_1                  (0x2U << GPIO_PULL_PULL10_Pos)          /*!< 0x00200000 */

/*!< PULL11 configuration */
#define GPIO_PULL_PULL11_Pos                (22U)
#define GPIO_PULL_PULL11_Msk                (0x3U << GPIO_PULL_PULL11_Pos)          /*!< 0x00C00000 */
#define GPIO_PULL_PULL11                    GPIO_PULL_PULL11_Msk                    /*!< PULL11[1:0] bits (GPIO x pull-up/pull-down configuration, pin 11) */
#define GPIO_PULL_PULL11_0                  (0x1U << GPIO_PULL_PULL11_Pos)          /*!< 0x00400000 */
#define GPIO_PULL_PULL11_1                  (0x2U << GPIO_PULL_PULL11_Pos)          /*!< 0x00800000 */

