ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405cx.h
/*******************  Bit definition for GPIO_WPR register  *******************/
#define GPIO_WPR_WPEN0_Pos                  (0U)
#define GPIO_WPR_WPEN0_Msk                  (0x1U << GPIO_WPR_WPEN0_Pos)            /*!< 0x00000001 */
#define GPIO_WPR_WPEN0                      GPIO_WPR_WPEN0_Msk                      /*!< Write protect enable, pin 0 */
#define GPIO_WPR_WPEN1_Pos                  (1U)
#define GPIO_WPR_WPEN1_Msk                  (0x1U << GPIO_WPR_WPEN1_Pos)            /*!< 0x00000002 */
#define GPIO_WPR_WPEN1                      GPIO_WPR_WPEN1_Msk                      /*!< Write protect enable, pin 1 */
#define GPIO_WPR_WPEN2_Pos                  (2U)
#define GPIO_WPR_WPEN2_Msk                  (0x1U << GPIO_WPR_WPEN2_Pos)            /*!< 0x00000004 */
#define GPIO_WPR_WPEN2                      GPIO_WPR_WPEN2_Msk                      /*!< Write protect enable, pin 2 */
#define GPIO_WPR_WPEN3_Pos                  (3U)
#define GPIO_WPR_WPEN3_Msk                  (0x1U << GPIO_WPR_WPEN3_Pos)            /*!< 0x00000008 */
#define GPIO_WPR_WPEN3                      GPIO_WPR_WPEN3_Msk                      /*!< Write protect enable, pin 3 */
#define GPIO_WPR_WPEN4_Pos                  (4U)
#define GPIO_WPR_WPEN4_Msk                  (0x1U << GPIO_WPR_WPEN4_Pos)            /*!< 0x00000010 */
#define GPIO_WPR_WPEN4                      GPIO_WPR_WPEN4_Msk                      /*!< Write protect enable, pin 4 */
#define GPIO_WPR_WPEN5_Pos                  (5U)
#define GPIO_WPR_WPEN5_Msk                  (0x1U << GPIO_WPR_WPEN5_Pos)            /*!< 0x00000020 */
#define GPIO_WPR_WPEN5                      GPIO_WPR_WPEN5_Msk                      /*!< Write protect enable, pin 5 */
#define GPIO_WPR_WPEN6_Pos                  (6U)
#define GPIO_WPR_WPEN6_Msk                  (0x1U << GPIO_WPR_WPEN6_Pos)            /*!< 0x00000040 */
#define GPIO_WPR_WPEN6                      GPIO_WPR_WPEN6_Msk                      /*!< Write protect enable, pin 6 */
#define GPIO_WPR_WPEN7_Pos                  (7U)
#define GPIO_WPR_WPEN7_Msk                  (0x1U << GPIO_WPR_WPEN7_Pos)            /*!< 0x00000080 */
#define GPIO_WPR_WPEN7                      GPIO_WPR_WPEN7_Msk                      /*!< Write protect enable, pin 7 */
#define GPIO_WPR_WPEN8_Pos                  (8U)
#define GPIO_WPR_WPEN8_Msk                  (0x1U << GPIO_WPR_WPEN8_Pos)            /*!< 0x00000100 */
#define GPIO_WPR_WPEN8                      GPIO_WPR_WPEN8_Msk                      /*!< Write protect enable, pin 8 */
#define GPIO_WPR_WPEN9_Pos                  (9U)
#define GPIO_WPR_WPEN9_Msk                  (0x1U << GPIO_WPR_WPEN9_Pos)            /*!< 0x00000200 */
#define GPIO_WPR_WPEN9                      GPIO_WPR_WPEN9_Msk                      /*!< Write protect enable, pin 9 */
#define GPIO_WPR_WPEN10_Pos                 (10U)
#define GPIO_WPR_WPEN10_Msk                 (0x1U << GPIO_WPR_WPEN10_Pos)           /*!< 0x00000400 */
#define GPIO_WPR_WPEN10                     GPIO_WPR_WPEN10_Msk                     /*!< Write protect enable, pin 10 */
#define GPIO_WPR_WPEN11_Pos                 (11U)
#define GPIO_WPR_WPEN11_Msk                 (0x1U << GPIO_WPR_WPEN11_Pos)           /*!< 0x00000800 */
#define GPIO_WPR_WPEN11                     GPIO_WPR_WPEN11_Msk                     /*!< Write protect enable, pin 11 */
#define GPIO_WPR_WPEN12_Pos                 (12U)
#define GPIO_WPR_WPEN12_Msk                 (0x1U << GPIO_WPR_WPEN12_Pos)           /*!< 0x00001000 */
#define GPIO_WPR_WPEN12                     GPIO_WPR_WPEN12_Msk                     /*!< Write protect enable, pin 12 */
#define GPIO_WPR_WPEN13_Pos                 (13U)
#define GPIO_WPR_WPEN13_Msk                 (0x1U << GPIO_WPR_WPEN13_Pos)           /*!< 0x00002000 */
#define GPIO_WPR_WPEN13                     GPIO_WPR_WPEN13_Msk                     /*!< Write protect enable, pin 13 */
#define GPIO_WPR_WPEN14_Pos                 (14U)
#define GPIO_WPR_WPEN14_Msk                 (0x1U << GPIO_WPR_WPEN14_Pos)           /*!< 0x00004000 */
#define GPIO_WPR_WPEN14                     GPIO_WPR_WPEN14_Msk                     /*!< Write protect enable, pin 14 */
#define GPIO_WPR_WPEN15_Pos                 (15U)
#define GPIO_WPR_WPEN15_Msk                 (0x1U << GPIO_WPR_WPEN15_Pos)           /*!< 0x00008000 */
#define GPIO_WPR_WPEN15                     GPIO_WPR_WPEN15_Msk                     /*!< Write protect enable, pin 15 */
#define GPIO_WPR_WPSEQ_Pos                  (16U)
#define GPIO_WPR_WPSEQ_Msk                  (0x1U << GPIO_WPR_WPSEQ_Pos)            /*!< 0x00010000 */
#define GPIO_WPR_WPSEQ                      GPIO_WPR_WPSEQ_Msk                      /*!< Write protect sequence */

/******************  Bit definition for GPIO_MUXL register  *******************/
#define GPIO_MUXL_MUXL_Pos                  (0U)
#define GPIO_MUXL_MUXL_Msk                  (0xFFFFFFFFU << GPIO_MUXL_MUXL_Pos)     /*!< 0xFFFFFFFF */
#define GPIO_MUXL_MUXL                      GPIO_MUXL_MUXL_Msk                      /*!< Multiplexed function select for GPIO x */

/*!< MUXL0 configuration */
#define GPIO_MUXL_MUXL0_Pos                 (0U)
#define GPIO_MUXL_MUXL0_Msk                 (0xFU << GPIO_MUXL_MUXL0_Pos)           /*!< 0x0000000F */
#define GPIO_MUXL_MUXL0                     GPIO_MUXL_MUXL0_Msk                     /*!< MUXL0[3:0] bits (Multiplexed function select for GPIO x, pin 0) */
#define GPIO_MUXL_MUXL0_0                   (0x1U << GPIO_MUXL_MUXL0_Pos)           /*!< 0x00000001 */
#define GPIO_MUXL_MUXL0_1                   (0x2U << GPIO_MUXL_MUXL0_Pos)           /*!< 0x00000002 */
#define GPIO_MUXL_MUXL0_2                   (0x4U << GPIO_MUXL_MUXL0_Pos)           /*!< 0x00000004 */
#define GPIO_MUXL_MUXL0_3                   (0x8U << GPIO_MUXL_MUXL0_Pos)           /*!< 0x00000008 */

/*!< MUXL1 configuration */
#define GPIO_MUXL_MUXL1_Pos                 (4U)
#define GPIO_MUXL_MUXL1_Msk                 (0xFU << GPIO_MUXL_MUXL1_Pos)           /*!< 0x000000F0 */
#define GPIO_MUXL_MUXL1                     GPIO_MUXL_MUXL1_Msk                     /*!< MUXL1[3:0] bits (Multiplexed function select for GPIO x, pin 1) */
#define GPIO_MUXL_MUXL1_0                   (0x1U << GPIO_MUXL_MUXL1_Pos)           /*!< 0x00000010 */
#define GPIO_MUXL_MUXL1_1                   (0x2U << GPIO_MUXL_MUXL1_Pos)           /*!< 0x00000020 */
#define GPIO_MUXL_MUXL1_2                   (0x4U << GPIO_MUXL_MUXL1_Pos)           /*!< 0x00000040 */
#define GPIO_MUXL_MUXL1_3                   (0x8U << GPIO_MUXL_MUXL1_Pos)           /*!< 0x00000080 */

/*!< MUXL2 configuration */
#define GPIO_MUXL_MUXL2_Pos                 (8U)
#define GPIO_MUXL_MUXL2_Msk                 (0xFU << GPIO_MUXL_MUXL2_Pos)           /*!< 0x00000F00 */
#define GPIO_MUXL_MUXL2                     GPIO_MUXL_MUXL2_Msk                     /*!< MUXL2[3:0] bits (Multiplexed function select for GPIO x, pin 2) */
#define GPIO_MUXL_MUXL2_0                   (0x1U << GPIO_MUXL_MUXL2_Pos)           /*!< 0x00000100 */
#define GPIO_MUXL_MUXL2_1                   (0x2U << GPIO_MUXL_MUXL2_Pos)           /*!< 0x00000200 */
#define GPIO_MUXL_MUXL2_2                   (0x4U << GPIO_MUXL_MUXL2_Pos)           /*!< 0x00000400 */
#define GPIO_MUXL_MUXL2_3                   (0x8U << GPIO_MUXL_MUXL2_Pos)           /*!< 0x00000800 */

