ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405cx.h
/****************  Bit definition for DMA_MUXSYNCSTS register  ****************/
#define DMA_MUXSYNCSTS_SYNCOVF_Pos          (0U)
#define DMA_MUXSYNCSTS_SYNCOVF_Msk          (0xFFU << DMA_MUXSYNCSTS_SYNCOVF_Pos)   /*!< 0x000000FF */
#define DMA_MUXSYNCSTS_SYNCOVF              DMA_MUXSYNCSTS_SYNCOVF_Msk              /*!< Synchronization overrun interrupt flag */

/****************  Bit definition for DMA_MUXSYNCCLR register  ****************/
#define DMA_MUXSYNCCLR_SYNCOVFC_Pos         (0U)
#define DMA_MUXSYNCCLR_SYNCOVFC_Msk         (0xFFU << DMA_MUXSYNCCLR_SYNCOVFC_Pos)  /*!< 0x000000FF */
#define DMA_MUXSYNCCLR_SYNCOVFC             DMA_MUXSYNCCLR_SYNCOVFC_Msk             /*!< Synchronization overrun interrupt flag clear */

/*****************  Bit definition for DMA_MUXGSTS register  ******************/
#define DMA_MUXGSTS_TRGOVF_Pos              (0U)
#define DMA_MUXGSTS_TRGOVF_Msk              (0xFU << DMA_MUXGSTS_TRGOVF_Pos)        /*!< 0x0000000F */
#define DMA_MUXGSTS_TRGOVF                  DMA_MUXGSTS_TRGOVF_Msk                  /*!< Trigger overrun interrupt flag */

/*****************  Bit definition for DMA_MUXGCLR register  ******************/
#define DMA_MUXGCLR_TRGOVFC_Pos             (0U)
#define DMA_MUXGCLR_TRGOVFC_Msk             (0xFU << DMA_MUXGCLR_TRGOVFC_Pos)       /*!< 0x0000000F */
#define DMA_MUXGCLR_TRGOVFC                 DMA_MUXGCLR_TRGOVFC_Msk                 /*!< Trigger overrun interrupt flag clear */

/******************************************************************************/
/*                                                                            */
/*                         CRC calculation unit (CRC)                         */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for CRC_DT register  ********************/
#define CRC_DT_DT_Pos                       (0U)
#define CRC_DT_DT_Msk                       (0xFFFFFFFFU << CRC_DT_DT_Pos)          /*!< 0xFFFFFFFF */
#define CRC_DT_DT                           CRC_DT_DT_Msk                           /*!< Data register bits */

/*******************  Bit definition for CRC_CDT register  ********************/
#define CRC_CDT_CDT_Pos                     (0U)
#define CRC_CDT_CDT_Msk                     (0xFFU << CRC_CDT_CDT_Pos)              /*!< 0x000000FF */
#define CRC_CDT_CDT                         CRC_CDT_CDT_Msk                         /*!< General-purpose 8-bit data register bits */

/*******************  Bit definition for CRC_CTRL register  *******************/
#define CRC_CTRL_RST_Pos                    (0U)
#define CRC_CTRL_RST_Msk                    (0x1U << CRC_CTRL_RST_Pos)              /*!< 0x00000001 */
#define CRC_CTRL_RST                        CRC_CTRL_RST_Msk                        /*!< Reset CRC calculation unit */

/*!< POLY_SIZE configuration */
#define CRC_CTRL_POLY_SIZE_Pos              (3U)
#define CRC_CTRL_POLY_SIZE_Msk              (0x3U << CRC_CTRL_POLY_SIZE_Pos)        /*!< 0x00000018 */
#define CRC_CTRL_POLY_SIZE                  CRC_CTRL_POLY_SIZE_Msk                  /*!< POLY_SIZE[1:0] bits (Polynomial size) */
#define CRC_CTRL_POLY_SIZE_0                (0x1U << CRC_CTRL_POLY_SIZE_Pos)        /*!< 0x00000008 */
#define CRC_CTRL_POLY_SIZE_1                (0x2U << CRC_CTRL_POLY_SIZE_Pos)        /*!< 0x00000010 */

#define CRC_CTRL_POLY_SIZE_32BIT            0x00000000U                             /*!< 32-bit */
#define CRC_CTRL_POLY_SIZE_16BIT_Pos        (3U)
#define CRC_CTRL_POLY_SIZE_16BIT_Msk        (0x1U << CRC_CTRL_POLY_SIZE_16BIT_Pos)  /*!< 0x00000008 */
#define CRC_CTRL_POLY_SIZE_16BIT            CRC_CTRL_POLY_SIZE_16BIT_Msk            /*!< 16-bit */
#define CRC_CTRL_POLY_SIZE_8BIT_Pos         (4U)
#define CRC_CTRL_POLY_SIZE_8BIT_Msk         (0x1U << CRC_CTRL_POLY_SIZE_8BIT_Pos)   /*!< 0x00000010 */
#define CRC_CTRL_POLY_SIZE_8BIT             CRC_CTRL_POLY_SIZE_8BIT_Msk             /*!< 8-bit */
#define CRC_CTRL_POLY_SIZE_7BIT_Pos         (3U)
#define CRC_CTRL_POLY_SIZE_7BIT_Msk         (0x3U << CRC_CTRL_POLY_SIZE_7BIT_Pos)   /*!< 0x00000018 */
#define CRC_CTRL_POLY_SIZE_7BIT             CRC_CTRL_POLY_SIZE_7BIT_Msk             /*!< 7-bit */

/*!< REVID configuration */
#define CRC_CTRL_REVID_Pos                  (5U)
#define CRC_CTRL_REVID_Msk                  (0x3U << CRC_CTRL_REVID_Pos)            /*!< 0x00000060 */
#define CRC_CTRL_REVID                      CRC_CTRL_REVID_Msk                      /*!< REVID[1:0] bits (Reverse input data) */
#define CRC_CTRL_REVID_0                    (0x1U << CRC_CTRL_REVID_Pos)            /*!< 0x00000020 */
#define CRC_CTRL_REVID_1                    (0x2U << CRC_CTRL_REVID_Pos)            /*!< 0x00000040 */

#define CRC_CTRL_REVID_NOREV                0x00000000U                             /*!< No effect */
#define CRC_CTRL_REVID_BYTEREV_Pos          (5U)
#define CRC_CTRL_REVID_BYTEREV_Msk          (0x1U << CRC_CTRL_REVID_BYTEREV_Pos)    /*!< 0x00000020 */
#define CRC_CTRL_REVID_BYTEREV              CRC_CTRL_REVID_BYTEREV_Msk              /*!< Byte reverse */
#define CRC_CTRL_REVID_HALFREV_Pos          (6U)
#define CRC_CTRL_REVID_HALFREV_Msk          (0x1U << CRC_CTRL_REVID_HALFREV_Pos)    /*!< 0x00000040 */
#define CRC_CTRL_REVID_HALFREV              CRC_CTRL_REVID_HALFREV_Msk              /*!< Half-word reverse */
#define CRC_CTRL_REVID_WORDREV_Pos          (5U)
#define CRC_CTRL_REVID_WORDREV_Msk          (0x3U << CRC_CTRL_REVID_WORDREV_Pos)    /*!< 0x00000060 */
#define CRC_CTRL_REVID_WORDREV              CRC_CTRL_REVID_WORDREV_Msk              /*!< Word reverse */

#define CRC_CTRL_REVOD_Pos                  (7U)
#define CRC_CTRL_REVOD_Msk                  (0x1U << CRC_CTRL_REVOD_Pos)            /*!< 0x00000080 */
#define CRC_CTRL_REVOD                      CRC_CTRL_REVOD_Msk                      /*!< Reverse output data */

/*******************  Bit definition for CRC_IDT register  ********************/
#define CRC_IDT_IDT_Pos                     (0U)
#define CRC_IDT_IDT_Msk                     (0xFFFFFFFFU << CRC_IDT_IDT_Pos)        /*!< 0xFFFFFFFF */
#define CRC_IDT_IDT                         CRC_IDT_IDT_Msk                         /*!< Initialization data register */

