ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405cx.h
/*******************  Bit definition for CAN_TMC1 register  *******************/
#define CAN_TMC1_TMDTBL_Pos                 (0U)
#define CAN_TMC1_TMDTBL_Msk                 (0xFU << CAN_TMC1_TMDTBL_Pos)           /*!< 0x0000000F */
#define CAN_TMC1_TMDTBL                     CAN_TMC1_TMDTBL_Msk                     /*!< Transmit mailbox data byte length */
#define CAN_TMC1_TMTSTEN_Pos                (8U)
#define CAN_TMC1_TMTSTEN_Msk                (0x1U << CAN_TMC1_TMTSTEN_Pos)          /*!< 0x00000100 */
#define CAN_TMC1_TMTSTEN                    CAN_TMC1_TMTSTEN_Msk                    /*!< Transmit mailbox time stamp transmit enable */
#define CAN_TMC1_TMTS_Pos                   (16U)
#define CAN_TMC1_TMTS_Msk                   (0xFFFFU << CAN_TMC1_TMTS_Pos)          /*!< 0xFFFF0000 */
#define CAN_TMC1_TMTS                       CAN_TMC1_TMTS_Msk                       /*!< Transmit mailbox time stamp */

/******************  Bit definition for CAN_TMDTL1 register  ******************/
#define CAN_TMDTL1_TMDT0_Pos                (0U)
#define CAN_TMDTL1_TMDT0_Msk                (0xFFU << CAN_TMDTL1_TMDT0_Pos)         /*!< 0x000000FF */
#define CAN_TMDTL1_TMDT0                    CAN_TMDTL1_TMDT0_Msk                    /*!< Transmit mailbox data byte 0 */
#define CAN_TMDTL1_TMDT1_Pos                (8U)
#define CAN_TMDTL1_TMDT1_Msk                (0xFFU << CAN_TMDTL1_TMDT1_Pos)         /*!< 0x0000FF00 */
#define CAN_TMDTL1_TMDT1                    CAN_TMDTL1_TMDT1_Msk                    /*!< Transmit mailbox data byte 1 */
#define CAN_TMDTL1_TMDT2_Pos                (16U)
#define CAN_TMDTL1_TMDT2_Msk                (0xFFU << CAN_TMDTL1_TMDT2_Pos)         /*!< 0x00FF0000 */
#define CAN_TMDTL1_TMDT2                    CAN_TMDTL1_TMDT2_Msk                    /*!< Transmit mailbox data byte 2 */
#define CAN_TMDTL1_TMDT3_Pos                (24U)
#define CAN_TMDTL1_TMDT3_Msk                (0xFFU << CAN_TMDTL1_TMDT3_Pos)         /*!< 0xFF000000 */
#define CAN_TMDTL1_TMDT3                    CAN_TMDTL1_TMDT3_Msk                    /*!< Transmit mailbox data byte 3 */

/******************  Bit definition for CAN_TMDTH1 register  ******************/
#define CAN_TMDTH1_TMDT4_Pos                (0U)
#define CAN_TMDTH1_TMDT4_Msk                (0xFFU << CAN_TMDTH1_TMDT4_Pos)         /*!< 0x000000FF */
#define CAN_TMDTH1_TMDT4                    CAN_TMDTH1_TMDT4_Msk                    /*!< Transmit mailbox data byte 4 */
#define CAN_TMDTH1_TMDT5_Pos                (8U)
#define CAN_TMDTH1_TMDT5_Msk                (0xFFU << CAN_TMDTH1_TMDT5_Pos)         /*!< 0x0000FF00 */
#define CAN_TMDTH1_TMDT5                    CAN_TMDTH1_TMDT5_Msk                    /*!< Transmit mailbox data byte 5 */
#define CAN_TMDTH1_TMDT6_Pos                (16U)
#define CAN_TMDTH1_TMDT6_Msk                (0xFFU << CAN_TMDTH1_TMDT6_Pos)         /*!< 0x00FF0000 */
#define CAN_TMDTH1_TMDT6                    CAN_TMDTH1_TMDT6_Msk                    /*!< Transmit mailbox data byte 6 */
#define CAN_TMDTH1_TMDT7_Pos                (24U)
#define CAN_TMDTH1_TMDT7_Msk                (0xFFU << CAN_TMDTH1_TMDT7_Pos)         /*!< 0xFF000000 */
#define CAN_TMDTH1_TMDT7                    CAN_TMDTH1_TMDT7_Msk                    /*!< Transmit mailbox data byte 7 */

/*******************  Bit definition for CAN_TMI2 register  *******************/
#define CAN_TMI2_TMSR_Pos                   (0U)
#define CAN_TMI2_TMSR_Msk                   (0x1U << CAN_TMI2_TMSR_Pos)             /*!< 0x00000001 */
#define CAN_TMI2_TMSR                       CAN_TMI2_TMSR_Msk                       /*!< Transmit mailbox send request */
#define CAN_TMI2_TMFRSEL_Pos                (1U)
#define CAN_TMI2_TMFRSEL_Msk                (0x1U << CAN_TMI2_TMFRSEL_Pos)          /*!< 0x00000002 */
#define CAN_TMI2_TMFRSEL                    CAN_TMI2_TMFRSEL_Msk                    /*!< Transmit mailbox frame type select */
#define CAN_TMI2_TMIDSEL_Pos                (2U)
#define CAN_TMI2_TMIDSEL_Msk                (0x1U << CAN_TMI2_TMIDSEL_Pos)          /*!< 0x00000004 */
#define CAN_TMI2_TMIDSEL                    CAN_TMI2_TMIDSEL_Msk                    /*!< Transmit mailbox identifier type select */
#define CAN_TMI2_TMEID_Pos                  (3U)
#define CAN_TMI2_TMEID_Msk                  (0x3FFFFU << CAN_TMI2_TMEID_Pos)        /*!< 0x001FFFF8 */
#define CAN_TMI2_TMEID                      CAN_TMI2_TMEID_Msk                      /*!< Transmit mailbox extended identifier */
#define CAN_TMI2_TMSID_Pos                  (21U)
#define CAN_TMI2_TMSID_Msk                  (0x7FFU << CAN_TMI2_TMSID_Pos)          /*!< 0xFFE00000 */
#define CAN_TMI2_TMSID                      CAN_TMI2_TMSID_Msk                      /*!< Transmit mailbox standard identifier or extended identifier high bytes */

/*******************  Bit definition for CAN_TMC2 register  *******************/
#define CAN_TMC2_TMDTBL_Pos                 (0U)
#define CAN_TMC2_TMDTBL_Msk                 (0xFU << CAN_TMC2_TMDTBL_Pos)           /*!< 0x0000000F */
#define CAN_TMC2_TMDTBL                     CAN_TMC2_TMDTBL_Msk                     /*!< Transmit mailbox data byte length */
#define CAN_TMC2_TMTSTEN_Pos                (8U)
#define CAN_TMC2_TMTSTEN_Msk                (0x1U << CAN_TMC2_TMTSTEN_Pos)          /*!< 0x00000100 */
#define CAN_TMC2_TMTSTEN                    CAN_TMC2_TMTSTEN_Msk                    /*!< Transmit mailbox time stamp transmit enable */
#define CAN_TMC2_TMTS_Pos                   (16U)
#define CAN_TMC2_TMTS_Msk                   (0xFFFFU << CAN_TMC2_TMTS_Pos)          /*!< 0xFFFF0000 */
#define CAN_TMC2_TMTS                       CAN_TMC2_TMTS_Msk                       /*!< Transmit mailbox time stamp */

/******************  Bit definition for CAN_TMDTL2 register  ******************/
#define CAN_TMDTL2_TMDT0_Pos                (0U)
#define CAN_TMDTL2_TMDT0_Msk                (0xFFU << CAN_TMDTL2_TMDT0_Pos)         /*!< 0x000000FF */
#define CAN_TMDTL2_TMDT0                    CAN_TMDTL2_TMDT0_Msk                    /*!< Transmit mailbox data byte 0 */
#define CAN_TMDTL2_TMDT1_Pos                (8U)
#define CAN_TMDTL2_TMDT1_Msk                (0xFFU << CAN_TMDTL2_TMDT1_Pos)         /*!< 0x0000FF00 */
#define CAN_TMDTL2_TMDT1                    CAN_TMDTL2_TMDT1_Msk                    /*!< Transmit mailbox data byte 1 */
#define CAN_TMDTL2_TMDT2_Pos                (16U)
#define CAN_TMDTL2_TMDT2_Msk                (0xFFU << CAN_TMDTL2_TMDT2_Pos)         /*!< 0x00FF0000 */
#define CAN_TMDTL2_TMDT2                    CAN_TMDTL2_TMDT2_Msk                    /*!< Transmit mailbox data byte 2 */
#define CAN_TMDTL2_TMDT3_Pos                (24U)
#define CAN_TMDTL2_TMDT3_Msk                (0xFFU << CAN_TMDTL2_TMDT3_Pos)         /*!< 0xFF000000 */
#define CAN_TMDTL2_TMDT3                    CAN_TMDTL2_TMDT3_Msk                    /*!< Transmit mailbox data byte 3 */

/******************  Bit definition for CAN_TMDTH2 register  ******************/
#define CAN_TMDTH2_TMDT4_Pos                (0U)
#define CAN_TMDTH2_TMDT4_Msk                (0xFFU << CAN_TMDTH2_TMDT4_Pos)         /*!< 0x000000FF */
#define CAN_TMDTH2_TMDT4                    CAN_TMDTH2_TMDT4_Msk                    /*!< Transmit mailbox data byte 4 */
#define CAN_TMDTH2_TMDT5_Pos                (8U)
#define CAN_TMDTH2_TMDT5_Msk                (0xFFU << CAN_TMDTH2_TMDT5_Pos)         /*!< 0x0000FF00 */
#define CAN_TMDTH2_TMDT5                    CAN_TMDTH2_TMDT5_Msk                    /*!< Transmit mailbox data byte 5 */
#define CAN_TMDTH2_TMDT6_Pos                (16U)
#define CAN_TMDTH2_TMDT6_Msk                (0xFFU << CAN_TMDTH2_TMDT6_Pos)         /*!< 0x00FF0000 */
#define CAN_TMDTH2_TMDT6                    CAN_TMDTH2_TMDT6_Msk                    /*!< Transmit mailbox data byte 6 */
#define CAN_TMDTH2_TMDT7_Pos                (24U)
#define CAN_TMDTH2_TMDT7_Msk                (0xFFU << CAN_TMDTH2_TMDT7_Pos)         /*!< 0xFF000000 */
#define CAN_TMDTH2_TMDT7                    CAN_TMDTH2_TMDT7_Msk                    /*!< Transmit mailbox data byte 7 */

/*******************  Bit definition for CAN_RFI0 register  *******************/
#define CAN_RFI0_RFFRI_Pos                  (1U)
#define CAN_RFI0_RFFRI_Msk                  (0x1U << CAN_RFI0_RFFRI_Pos)            /*!< 0x00000002 */
#define CAN_RFI0_RFFRI                      CAN_RFI0_RFFRI_Msk                      /*!< Receive FIFO frame type indication */
#define CAN_RFI0_RFIDI_Pos                  (2U)
#define CAN_RFI0_RFIDI_Msk                  (0x1U << CAN_RFI0_RFIDI_Pos)            /*!< 0x00000004 */
#define CAN_RFI0_RFIDI                      CAN_RFI0_RFIDI_Msk                      /*!< Receive FIFO identifier type indication */
#define CAN_RFI0_RFEID_Pos                  (3U)
#define CAN_RFI0_RFEID_Msk                  (0x3FFFFU << CAN_RFI0_RFEID_Pos)        /*!< 0x001FFFF8 */
#define CAN_RFI0_RFEID                      CAN_RFI0_RFEID_Msk                      /*!< Receive FIFO extended identifier */
#define CAN_RFI0_RFSID_Pos                  (21U)
#define CAN_RFI0_RFSID_Msk                  (0x7FFU << CAN_RFI0_RFSID_Pos)          /*!< 0xFFE00000 */
#define CAN_RFI0_RFSID                      CAN_RFI0_RFSID_Msk                      /*!< Receive FIFO standard identifier or receive FIFO extended identifier */

/*******************  Bit definition for CAN_RFC0 register  *******************/
#define CAN_RFC0_RFDTL_Pos                  (0U)
#define CAN_RFC0_RFDTL_Msk                  (0xFU << CAN_RFC0_RFDTL_Pos)            /*!< 0x0000000F */
#define CAN_RFC0_RFDTL                      CAN_RFC0_RFDTL_Msk                      /*!< Receive FIFO data length */
#define CAN_RFC0_RFFMN_Pos                  (8U)
#define CAN_RFC0_RFFMN_Msk                  (0xFFU << CAN_RFC0_RFFMN_Pos)           /*!< 0x0000FF00 */
#define CAN_RFC0_RFFMN                      CAN_RFC0_RFFMN_Msk                      /*!< Receive FIFO filter match number */
#define CAN_RFC0_RFTS_Pos                   (16U)
#define CAN_RFC0_RFTS_Msk                   (0xFFFFU << CAN_RFC0_RFTS_Pos)          /*!< 0xFFFF0000 */
#define CAN_RFC0_RFTS                       CAN_RFC0_RFTS_Msk                       /*!< Receive FIFO time stamp */

/******************  Bit definition for CAN_RFDTL0 register  ******************/
#define CAN_RFDTL0_RFDT0_Pos                (0U)
#define CAN_RFDTL0_RFDT0_Msk                (0xFFU << CAN_RFDTL0_RFDT0_Pos)         /*!< 0x000000FF */
#define CAN_RFDTL0_RFDT0                    CAN_RFDTL0_RFDT0_Msk                    /*!< Receive FIFO data byte 0 */
#define CAN_RFDTL0_RFDT1_Pos                (8U)
#define CAN_RFDTL0_RFDT1_Msk                (0xFFU << CAN_RFDTL0_RFDT1_Pos)         /*!< 0x0000FF00 */
#define CAN_RFDTL0_RFDT1                    CAN_RFDTL0_RFDT1_Msk                    /*!< Receive FIFO data byte 1 */
#define CAN_RFDTL0_RFDT2_Pos                (16U)
#define CAN_RFDTL0_RFDT2_Msk                (0xFFU << CAN_RFDTL0_RFDT2_Pos)         /*!< 0x00FF0000 */
#define CAN_RFDTL0_RFDT2                    CAN_RFDTL0_RFDT2_Msk                    /*!< Receive FIFO data byte 2 */
#define CAN_RFDTL0_RFDT3_Pos                (24U)
#define CAN_RFDTL0_RFDT3_Msk                (0xFFU << CAN_RFDTL0_RFDT3_Pos)         /*!< 0xFF000000 */
#define CAN_RFDTL0_RFDT3                    CAN_RFDTL0_RFDT3_Msk                    /*!< Receive FIFO data byte 3 */

/******************  Bit definition for CAN_RFDTH0 register  ******************/
#define CAN_RFDTH0_RFDT4_Pos                (0U)
#define CAN_RFDTH0_RFDT4_Msk                (0xFFU << CAN_RFDTH0_RFDT4_Pos)         /*!< 0x000000FF */
#define CAN_RFDTH0_RFDT4                    CAN_RFDTH0_RFDT4_Msk                    /*!< Receive FIFO data byte 4 */
#define CAN_RFDTH0_RFDT5_Pos                (8U)
#define CAN_RFDTH0_RFDT5_Msk                (0xFFU << CAN_RFDTH0_RFDT5_Pos)         /*!< 0x0000FF00 */
#define CAN_RFDTH0_RFDT5                    CAN_RFDTH0_RFDT5_Msk                    /*!< Receive FIFO data byte 5 */
#define CAN_RFDTH0_RFDT6_Pos                (16U)
#define CAN_RFDTH0_RFDT6_Msk                (0xFFU << CAN_RFDTH0_RFDT6_Pos)         /*!< 0x00FF0000 */
#define CAN_RFDTH0_RFDT6                    CAN_RFDTH0_RFDT6_Msk                    /*!< Receive FIFO data byte 6 */
#define CAN_RFDTH0_RFDT7_Pos                (24U)
#define CAN_RFDTH0_RFDT7_Msk                (0xFFU << CAN_RFDTH0_RFDT7_Pos)         /*!< 0xFF000000 */
#define CAN_RFDTH0_RFDT7                    CAN_RFDTH0_RFDT7_Msk                    /*!< Receive FIFO data byte 7 */

/*******************  Bit definition for CAN_RFI1 register  *******************/
#define CAN_RFI1_RFFRI_Pos                  (1U)
#define CAN_RFI1_RFFRI_Msk                  (0x1U << CAN_RFI1_RFFRI_Pos)            /*!< 0x00000002 */
#define CAN_RFI1_RFFRI                      CAN_RFI1_RFFRI_Msk                      /*!< Receive FIFO frame type indication */
#define CAN_RFI1_RFIDI_Pos                  (2U)
#define CAN_RFI1_RFIDI_Msk                  (0x1U << CAN_RFI1_RFIDI_Pos)            /*!< 0x00000004 */
#define CAN_RFI1_RFIDI                      CAN_RFI1_RFIDI_Msk                      /*!< Receive FIFO identifier type indication */
#define CAN_RFI1_RFEID_Pos                  (3U)
#define CAN_RFI1_RFEID_Msk                  (0x3FFFFU << CAN_RFI1_RFEID_Pos)        /*!< 0x001FFFF8 */
#define CAN_RFI1_RFEID                      CAN_RFI1_RFEID_Msk                      /*!< Receive FIFO extended identifier */
#define CAN_RFI1_RFSID_Pos                  (21U)
#define CAN_RFI1_RFSID_Msk                  (0x7FFU << CAN_RFI1_RFSID_Pos)          /*!< 0xFFE00000 */
#define CAN_RFI1_RFSID                      CAN_RFI1_RFSID_Msk                      /*!< Receive FIFO standard identifier or receive FIFO extended identifier */

