ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F402_405/at32f402_405cx.h
/***************  Bit definition for DEBUG_APB1_PAUSE register  ***************/
#define DEBUG_APB1_PAUSE_TMR2_PAUSE_Pos     (0U)                                    /*!< 0x00000001 */
#define DEBUG_APB1_PAUSE_TMR2_PAUSE_Msk     (0x1U << DEBUG_APB1_PAUSE_TMR2_PAUSE_Pos)
#define DEBUG_APB1_PAUSE_TMR2_PAUSE         DEBUG_APB1_PAUSE_TMR2_PAUSE_Msk         /*!< TMR2 pause control bit */
#define DEBUG_APB1_PAUSE_TMR3_PAUSE_Pos     (1U)                                    /*!< 0x00000002 */
#define DEBUG_APB1_PAUSE_TMR3_PAUSE_Msk     (0x1U << DEBUG_APB1_PAUSE_TMR3_PAUSE_Pos)
#define DEBUG_APB1_PAUSE_TMR3_PAUSE         DEBUG_APB1_PAUSE_TMR3_PAUSE_Msk         /*!< TMR3 pause control bit */
#define DEBUG_APB1_PAUSE_TMR4_PAUSE_Pos     (2U)                                    /*!< 0x00000004 */
#define DEBUG_APB1_PAUSE_TMR4_PAUSE_Msk     (0x1U << DEBUG_APB1_PAUSE_TMR4_PAUSE_Pos)
#define DEBUG_APB1_PAUSE_TMR4_PAUSE         DEBUG_APB1_PAUSE_TMR4_PAUSE_Msk         /*!< TMR4 pause control bit */
#define DEBUG_APB1_PAUSE_TMR6_PAUSE_Pos     (4U)                                    /*!< 0x00000010 */
#define DEBUG_APB1_PAUSE_TMR6_PAUSE_Msk     (0x1U << DEBUG_APB1_PAUSE_TMR6_PAUSE_Pos)
#define DEBUG_APB1_PAUSE_TMR6_PAUSE         DEBUG_APB1_PAUSE_TMR6_PAUSE_Msk         /*!< TMR6 pause control bit */
#define DEBUG_APB1_PAUSE_TMR7_PAUSE_Pos     (5U)                                    /*!< 0x00000020 */
#define DEBUG_APB1_PAUSE_TMR7_PAUSE_Msk     (0x1U << DEBUG_APB1_PAUSE_TMR7_PAUSE_Pos)
#define DEBUG_APB1_PAUSE_TMR7_PAUSE         DEBUG_APB1_PAUSE_TMR7_PAUSE_Msk         /*!< TMR7 pause control bit */
#define DEBUG_APB1_PAUSE_TMR13_PAUSE_Pos    (7U)                                    /*!< 0x00000080 */
#define DEBUG_APB1_PAUSE_TMR13_PAUSE_Msk    (0x1U << DEBUG_APB1_PAUSE_TMR13_PAUSE_Pos)
#define DEBUG_APB1_PAUSE_TMR13_PAUSE        DEBUG_APB1_PAUSE_TMR13_PAUSE_Msk        /*!< TMR13 pause control bit */
#define DEBUG_APB1_PAUSE_TMR14_PAUSE_Pos    (8U)                                    /*!< 0x00000100 */
#define DEBUG_APB1_PAUSE_TMR14_PAUSE_Msk    (0x1U << DEBUG_APB1_PAUSE_TMR14_PAUSE_Pos)
#define DEBUG_APB1_PAUSE_TMR14_PAUSE        DEBUG_APB1_PAUSE_TMR14_PAUSE_Msk        /*!< TMR14 pause control bit */
#define DEBUG_APB1_PAUSE_ERTC_PAUSE_Pos     (10U)                                   /*!< 0x00000400 */
#define DEBUG_APB1_PAUSE_ERTC_PAUSE_Msk     (0x1U << DEBUG_APB1_PAUSE_ERTC_PAUSE_Pos)
#define DEBUG_APB1_PAUSE_ERTC_PAUSE         DEBUG_APB1_PAUSE_ERTC_PAUSE_Msk         /*!< ERTC pause control bit */
#define DEBUG_APB1_PAUSE_WWDT_PAUSE_Pos     (11U)                                   /*!< 0x00000800 */
#define DEBUG_APB1_PAUSE_WWDT_PAUSE_Msk     (0x1U << DEBUG_APB1_PAUSE_WWDT_PAUSE_Pos)
#define DEBUG_APB1_PAUSE_WWDT_PAUSE         DEBUG_APB1_PAUSE_WWDT_PAUSE_Msk         /*!< Window watchdog pause control bit */
#define DEBUG_APB1_PAUSE_WDT_PAUSE_Pos      (12U)                                   /*!< 0x00001000 */
#define DEBUG_APB1_PAUSE_WDT_PAUSE_Msk      (0x1U << DEBUG_APB1_PAUSE_WDT_PAUSE_Pos)
#define DEBUG_APB1_PAUSE_WDT_PAUSE          DEBUG_APB1_PAUSE_WDT_PAUSE_Msk          /*!< Watchdog pause control bit */
#define DEBUG_APB1_PAUSE_I2C1_SMBUS_TIMEOUT_Pos (24U)                               /*!< 0x01000000 */
#define DEBUG_APB1_PAUSE_I2C1_SMBUS_TIMEOUT_Msk (0x1U << DEBUG_APB1_PAUSE_I2C1_SMBUS_TIMEOUT_Pos)
#define DEBUG_APB1_PAUSE_I2C1_SMBUS_TIMEOUT     DEBUG_APB1_PAUSE_I2C1_SMBUS_TIMEOUT_Msk /*!< I2C1 pause control bit */
#define DEBUG_APB1_PAUSE_CAN1_PAUSE_Pos     (25U)                                   /*!< 0x02000000 */
#define DEBUG_APB1_PAUSE_CAN1_PAUSE_Msk     (0x1U << DEBUG_APB1_PAUSE_CAN1_PAUSE_Pos)
#define DEBUG_APB1_PAUSE_CAN1_PAUSE         DEBUG_APB1_PAUSE_CAN1_PAUSE_Msk         /*!< CAN1 pause control bit */
#define DEBUG_APB1_PAUSE_I2C2_SMBUS_TIMEOUT_Pos (27U)                               /*!< 0x08000000 */
#define DEBUG_APB1_PAUSE_I2C2_SMBUS_TIMEOUT_Msk (0x1U << DEBUG_APB1_PAUSE_I2C2_SMBUS_TIMEOUT_Pos)
#define DEBUG_APB1_PAUSE_I2C2_SMBUS_TIMEOUT     DEBUG_APB1_PAUSE_I2C2_SMBUS_TIMEOUT_Msk /*!< I2C2 pause control bit */
#define DEBUG_APB1_PAUSE_I2C3_SMBUS_TIMEOUT_Pos (28U)                               /*!< 0x10000000 */
#define DEBUG_APB1_PAUSE_I2C3_SMBUS_TIMEOUT_Msk (0x1U << DEBUG_APB1_PAUSE_I2C3_SMBUS_TIMEOUT_Pos)
#define DEBUG_APB1_PAUSE_I2C3_SMBUS_TIMEOUT     DEBUG_APB1_PAUSE_I2C3_SMBUS_TIMEOUT_Msk /*!< I2C3 pause control bit */

/***************  Bit definition for DEBUG_APB2_PAUSE register  ***************/
#define DEBUG_APB2_PAUSE_TMR1_PAUSE_Pos     (0U)                                    /*!< 0x00000001 */
#define DEBUG_APB2_PAUSE_TMR1_PAUSE_Msk     (0x1U << DEBUG_APB2_PAUSE_TMR1_PAUSE_Pos)
#define DEBUG_APB2_PAUSE_TMR1_PAUSE         DEBUG_APB2_PAUSE_TMR1_PAUSE_Msk         /*!< TMR1 pause control bit */
#define DEBUG_APB2_PAUSE_TMR9_PAUSE_Pos     (16U)                                   /*!< 0x00010000 */
#define DEBUG_APB2_PAUSE_TMR9_PAUSE_Msk     (0x1U << DEBUG_APB2_PAUSE_TMR9_PAUSE_Pos)
#define DEBUG_APB2_PAUSE_TMR9_PAUSE         DEBUG_APB2_PAUSE_TMR9_PAUSE_Msk         /*!< TMR9 pause control bit */
#define DEBUG_APB2_PAUSE_TMR10_PAUSE_Pos    (17U)                                   /*!< 0x00020000 */
#define DEBUG_APB2_PAUSE_TMR10_PAUSE_Msk    (0x1U << DEBUG_APB2_PAUSE_TMR10_PAUSE_Pos)
#define DEBUG_APB2_PAUSE_TMR10_PAUSE        DEBUG_APB2_PAUSE_TMR10_PAUSE_Msk        /*!< TMR10 pause control bit */
#define DEBUG_APB2_PAUSE_TMR11_PAUSE_Pos    (18U)                                   /*!< 0x00040000 */
#define DEBUG_APB2_PAUSE_TMR11_PAUSE_Msk    (0x1U << DEBUG_APB2_PAUSE_TMR11_PAUSE_Pos)
#define DEBUG_APB2_PAUSE_TMR11_PAUSE        DEBUG_APB2_PAUSE_TMR11_PAUSE_Msk        /*!< TMR11 pause control bit */

/*****************  Bit definition for DEBUG_SER_ID register  *****************/
/*!< REV_ID configuration */
#define DEBUG_SER_ID_REV_ID_Pos             (0U)
#define DEBUG_SER_ID_REV_ID_Msk             (0x7U << DEBUG_SER_ID_REV_ID_Pos)       /*!< 0x00000007 */
#define DEBUG_SER_ID_REV_ID                 DEBUG_SER_ID_REV_ID_Msk                 /*!< REV_ID[2:0] bits (Revision ID) */
#define DEBUG_SER_ID_REV_ID_0               (0x1U << DEBUG_SER_ID_REV_ID_Pos)       /*!< 0x00000001 */
#define DEBUG_SER_ID_REV_ID_1               (0x2U << DEBUG_SER_ID_REV_ID_Pos)       /*!< 0x00000002 */
#define DEBUG_SER_ID_REV_ID_2               (0x4U << DEBUG_SER_ID_REV_ID_Pos)       /*!< 0x00000004 */

/*!< SER_ID configuration */
#define DEBUG_SER_ID_SER_ID_Pos             (8U)
#define DEBUG_SER_ID_SER_ID_Msk             (0xFFU << DEBUG_SER_ID_SER_ID_Pos)      /*!< 0x0000FF00 */
#define DEBUG_SER_ID_SER_ID                 DEBUG_SER_ID_SER_ID_Msk                 /*!< SER_ID[7:0] bits (Serial ID) */
#define DEBUG_SER_ID_SER_ID_0               (0x01U << DEBUG_SER_ID_SER_ID_Pos)      /*!< 0x00000100 */
#define DEBUG_SER_ID_SER_ID_1               (0x02U << DEBUG_SER_ID_SER_ID_Pos)      /*!< 0x00000200 */
#define DEBUG_SER_ID_SER_ID_2               (0x04U << DEBUG_SER_ID_SER_ID_Pos)      /*!< 0x00000400 */
#define DEBUG_SER_ID_SER_ID_3               (0x08U << DEBUG_SER_ID_SER_ID_Pos)      /*!< 0x00000800 */
#define DEBUG_SER_ID_SER_ID_4               (0x10U << DEBUG_SER_ID_SER_ID_Pos)      /*!< 0x00001000 */
#define DEBUG_SER_ID_SER_ID_5               (0x20U << DEBUG_SER_ID_SER_ID_Pos)      /*!< 0x00002000 */
#define DEBUG_SER_ID_SER_ID_6               (0x40U << DEBUG_SER_ID_SER_ID_Pos)      /*!< 0x00004000 */
#define DEBUG_SER_ID_SER_ID_7               (0x80U << DEBUG_SER_ID_SER_ID_Pos)      /*!< 0x00008000 */

/**
  * @}
*/

/**
  * @}
*/ 

/** @addtogroup Exported_macro
  * @{
  */

#define CRM_HEXT_MIN        4000000U
#define CRM_HEXT_MAX       25000000U

#define CRM_MAX_FREQUENCY 216000000U

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __AT32F402_405Cx_H */

/*********************** (C) COPYRIGHT Artery Technology *****END OF FILE****/
